```
=========> Existing resources:
[command]/usr/local/vss-agent/2.309.0/_work/_temp/2008aaa1-b8ae-4c75-a837-7361e9213c41/terraform-bin state list
module.acr.data.azurerm_container_registry_scope_map.pull
module.acr.data.azurerm_container_registry_scope_map.push
module.acr.azurerm_container_registry.this
module.acr.azurerm_container_registry_token.pull
module.acr.azurerm_container_registry_token.push
module.acr.azurerm_container_registry_token_password.pull_password
module.acr.azurerm_container_registry_token_password.push_password
module.acr.azurerm_private_dns_a_record.data
module.acr.azurerm_private_dns_a_record.login_server
module.acr.azurerm_private_dns_zone.pdz
module.acr.azurerm_private_dns_zone_virtual_network_link.vnetlink_private
module.acr.azurerm_private_endpoint.pep
module.acr.azurerm_subnet.acr
module.acr.azurerm_subnet.container_apps
module.acr.azurerm_virtual_network.vnet
module.container_apps.azurerm_application_insights.this
module.docker_image.docker_image.proxy
module.docker_image.docker_registry_image.proxy
module.docker_image.null_resource.go_code_keeper
module.resource_group.azurerm_resource_group.this
module.acr.module.public_ip.data.curl.big_data_cloud
module.container_apps.module.telemetry_proxy.azurerm_container_app.container_app["telemetry_proxy"]
module.container_apps.module.telemetry_proxy.azurerm_container_app_environment.container_env
module.container_apps.module.telemetry_proxy.azurerm_log_analytics_workspace.laws[0]
::debug::Terraform exited with code 0.
::debug::stdout: module.acr.data.azurerm_container_registry_scope_map.pull%0Amodule.acr.data.azurerm_container_registry_scope_map.push%0Amodule.acr.azurerm_container_registry.this%0Amodule.acr.azurerm_container_registry_token.pull%0Amodule.acr.azurerm_container_registry_token.push%0Amodule.acr.azurerm_container_registry_token_password.pull_password%0Amodule.acr.azurerm_container_registry_token_password.push_password%0Amodule.acr.azurerm_private_dns_a_record.data%0Amodule.acr.azurerm_private_dns_a_record.login_server%0Amodule.acr.azurerm_private_dns_zone.pdz%0Amodule.acr.azurerm_private_dns_zone_virtual_network_link.vnetlink_private%0Amodule.acr.azurerm_private_endpoint.pep%0Amodule.acr.azurerm_subnet.acr%0Amodule.acr.azurerm_subnet.container_apps%0Amodule.acr.azurerm_virtual_network.vnet%0Amodule.container_apps.azurerm_application_insights.this%0Amodule.docker_image.docker_image.proxy%0Amodule.docker_image.docker_registry_image.proxy%0Amodule.docker_image.null_resource.go_code_keeper%0Amodule.resource_group.azurerm_resource_group.this%0Amodule.acr.module.public_ip.data.curl.big_data_cloud%0Amodule.container_apps.module.telemetry_proxy.azurerm_container_app.container_app["telemetry_proxy"]%0Amodule.container_apps.module.telemetry_proxy.azurerm_container_app_environment.container_env%0Amodule.container_apps.module.telemetry_proxy.azurerm_log_analytics_workspace.laws[0]%0A
::debug::stderr: 
::debug::exitcode: 0
[command]/usr/local/vss-agent/2.309.0/_work/_temp/2008aaa1-b8ae-4c75-a837-7361e9213c41/terraform-bin show -no-color tfplan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.docker_image.docker_image.proxy has been deleted
  - resource "docker_image" "proxy" {
        id       = "sha256:5edde3eb17d7232c70ad197fb4babd7e1c0aa1a499eb341c25570359a0bdb26cavmtelemetry.azurecr.io/telemetry_proxy"
      - name     = "avmtelemetry.azurecr.io/telemetry_proxy" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.docker_image.docker_image.proxy will be created
  + resource "docker_image" "proxy" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "avmtelemetry.azurecr.io/telemetry_proxy"
      + repo_digest = (known after apply)
      + triggers    = {
          + "code_hash" = "2ce6a537508f27b0d4eacaff12ceed89"
        }

      + build {
          + cache_from   = []
          + context      = "docker_image"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "avmtelemetry.azurecr.io/telemetry_proxy:latest",
            ]
        }
    }

  # module.traffic_manager.azurerm_traffic_manager_external_endpoint.this will be created
  + resource "azurerm_traffic_manager_external_endpoint" "this" {
      + enabled           = true
      + endpoint_location = "eastus"
      + id                = (known after apply)
      + name              = "endpoint"
      + priority          = (known after apply)
      + profile_id        = (known after apply)
      + target            = "telemetry-proxy.blackbay-274164b3.eastus.azurecontainerapps.io"
      + weight            = 100
    }

  # module.traffic_manager.azurerm_traffic_manager_profile.this will be created
  + resource "azurerm_traffic_manager_profile" "this" {
      + fqdn                   = (known after apply)
      + id                     = (known after apply)
      + name                   = "tfmodtelemetry-svc"
      + profile_status         = (known after apply)
      + resource_group_name    = "avm-telemetry"
      + traffic_routing_method = "Performance"

      + dns_config {
          + relative_name = "avmtftelemetry"
          + ttl           = 600
        }

      + monitor_config {
          + expected_status_code_ranges  = [
              + "200-202",
            ]
          + interval_in_seconds          = 30
          + path                         = "/telemetry"
          + port                         = 443
          + protocol                     = "HTTPS"
          + timeout_in_seconds           = 10
          + tolerated_number_of_failures = 3
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + telemetry_endpoint = (known after apply)
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.docker_image.docker_image.proxy has been deleted%0A  - resource "docker_image" "proxy" {%0A        id       = "sha256:5edde3eb17d7232c70ad197fb4babd7e1c0aa1a499eb341c25570359a0bdb26cavmtelemetry.azurecr.io/telemetry_proxy"%0A      - name     = "avmtelemetry.azurecr.io/telemetry_proxy" -> null%0A        # (2 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.docker_image.docker_image.proxy will be created%0A  + resource "docker_image" "proxy" {%0A      + id          = (known after apply)%0A      + image_id    = (known after apply)%0A      + name        = "avmtelemetry.azurecr.io/telemetry_proxy"%0A      + repo_digest = (known after apply)%0A      + triggers    = {%0A          + "code_hash" = "2ce6a537508f27b0d4eacaff12ceed89"%0A        }%0A%0A      + build {%0A          + cache_from   = []%0A          + context      = "docker_image"%0A          + dockerfile   = "Dockerfile"%0A          + extra_hosts  = []%0A          + remove       = true%0A          + security_opt = []%0A          + tag          = [%0A              + "avmtelemetry.azurecr.io/telemetry_proxy:latest",%0A            ]%0A        }%0A    }%0A%0A  # module.traffic_manager.azurerm_traffic_manager_external_endpoint.this will be created%0A  + resource "azurerm_traffic_manager_external_endpoint" "this" {%0A      + enabled           = true%0A      + endpoint_location = "eastus"%0A      + id                = (known after apply)%0A      + name              = "endpoint"%0A      + priority          = (known after apply)%0A      + profile_id        = (known after apply)%0A      + target            = "telemetry-proxy.blackbay-274164b3.eastus.azurecontainerapps.io"%0A      + weight            = 100%0A    }%0A%0A  # module.traffic_manager.azurerm_traffic_manager_profile.this will be created%0A  + resource "azurerm_traffic_manager_profile" "this" {%0A      + fqdn                   = (known after apply)%0A      + id                     = (known after apply)%0A      + name                   = "tfmodtelemetry-svc"%0A      + profile_status         = (known after apply)%0A      + resource_group_name    = "avm-telemetry"%0A      + traffic_routing_method = "Performance"%0A%0A      + dns_config {%0A          + relative_name = "avmtftelemetry"%0A          + ttl           = 600%0A        }%0A%0A      + monitor_config {%0A          + expected_status_code_ranges  = [%0A              + "200-202",%0A            ]%0A          + interval_in_seconds          = 30%0A          + path                         = "/telemetry"%0A          + port                         = 443%0A          + protocol                     = "HTTPS"%0A          + timeout_in_seconds           = 10%0A          + tolerated_number_of_failures = 3%0A        }%0A    }%0A%0APlan: 3 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + telemetry_endpoint = (known after apply)%0A
::debug::stderr: 
::debug::exitcode: 0

```